Revit 2024 API
ConnectionValidationInfo Constructor
 Constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ConnectionValidationInfo()
Visual Basic
Public Sub New
Visual C++
public:
ConnectionValidationInfo()
See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace